#include "LMP91000.h"	
#include "i2c.h"

/**************************************************************************************
 * 描  述 : ，配置寄存器，芯片lmp91000指定地址写入命令
 * 入  参 : add地址,dat命令
 * 返回值 : 无
 **************************************************************************************/
void LMP91000_Write(uint8 address,uint8 dat)
{				   	  	    																 
  I2C_Start();                	//启动总线   
	I2C_SendData(0x90);	 					//写数据0x90，读数据0x91
	I2C_RecvACK();							//等待应答
 	I2C_SendData(address);        //发送地址
	I2C_RecvACK();	            //等待应答 										  		   
	I2C_SendData(dat);            //发送指令数据					   
	I2C_RecvACK();		          //等待应答  	
 	I2C_Stop();                   //结束总线
	delay_ms(10);	                //该延时保证连续发送字节的稳定性	
}


/**************************************************************************************
 * 描  述 : ，配置寄存器，芯片lmp91000指定地址写入命令
 * 入  参 : add地址,dat命令
 * 返回值 : 无
 **************************************************************************************/
//void LMP91000_Write(uint8 address,uint8 dat)
//{				   	  	    																 
//  I2C_Start();                	//启动总线   
//	I2C_SendByte(0x90);	 					//写数据0x90，读数据0x91
//	I2C_Check_ACK();							//等待应答
// 	I2C_SendByte(add);            //发送地址
//	I2C_Check_ACK();	            //等待应答 										  		   
// 	I2C_Stop();                   //结束总线
//	delay_ms(10);	                //该延时保证连续发送字节的稳定性	
//}

/**************************************************************************************
 * 描  述 : lmp91000指定地址读出命令
 * 入  参 : add地址
 * 返回值 : temp
 **************************************************************************************/
uint8 LMP91000_Read(uint8 address)
{		
	uint8  temp=0;	
	I2C_Start();                	//启动总线   
	I2C_SendData(0x90);	 					//写数据0x90，读数据0x91
	I2C_RecvACK();							//等待应答
 	I2C_SendData(address);        //发送地址
	I2C_RecvACK();	            //等待应答 										  		   
 	I2C_Stop();                   //结束总线
	delay_ms(10);	 
	
  I2C_Start();                  //启动总线   
	I2C_SendData(0x91);	 					//写数据0x90，读数据0x91
	I2C_RecvACK();							//等待应答
 	temp=I2C_RecvData();    			   		     	
 	I2C_Stop();                   //结束总线
	delay_ms(10);	                //该延时保证连续发送字节的稳定性	
	return temp;	
}

/**************************************************************************************
 * 描  述 : lmp91000初始化
 * 入  参 : 无
 * 返回值 : 无
 **************************************************************************************/
void LMP91000_Init(void)
{	
	while(0==LMP91000_Read(0X00));//初始化，LMP准备就绪，地址0x00读出 	0 no ready |  1 ready 
	LMP91000_Write(0X01,0X00);		//unlock 0x10 and 0x011      0x00 write | 0x01 only read
	LMP91000_Write(0X10,0X1F);		//0001 1111  Rgain=350kΩ  Rload=100Ω
	LMP91000_Write(0X11,0X00);		//internal voltage source | int_z=20% | Vwe-Vre<0V | bias=0%	
	LMP91000_Write(0X12,0X03);		//FET_SHORT=0 disable | 3_lead
	LMP91000_Write(0X01,0X01);		//LOCK 	
}
